InDeviceMex/TM4C123/TM4C123_ACOMP/xDriver_MCU/EEPROM/Peripheral/Register/xHeader/EEPROM_RegisterDefines.h
/**
 *
 * @file EEPROM_RegisterDefines.h
 * @copyright
 * @verbatim InDeviceMex 2020 @endverbatim
 *
 * @par Responsibility
 * @verbatim InDeviceMex Developers @endverbatim
 *
 * @version
 * @verbatim 1.0 @endverbatim
 *
 * @date
 * @verbatim 21 jun. 2020 @endverbatim
 *
 * @author
 * @verbatim vyldram @endverbatim
 *
 * @par Change History
 * @verbatim
 * Date           Author     Version     Description
 * 21 jun. 2020     vyldram    1.0         initial Version@endverbatim
 */
#ifndef XDRIVER_MCU_DRIVER_HEADER_EEPROM_EEPROM_PERIPHERAL_EEPROM_REGISTER_EEPROM_REGISTERDEFINES_H_
#define XDRIVER_MCU_DRIVER_HEADER_EEPROM_EEPROM_PERIPHERAL_EEPROM_REGISTER_EEPROM_REGISTERDEFINES_H_

#include <xUtils/Standard/Standard.h>

/******************************************************************************************
************************************ 1 EESIZE *********************************************
******************************************************************************************/

/*----------*/
#define EEPROM_EESIZE_R_WORDCNT_MASK     ((uint32_t)0x0000FFFFU)
#define EEPROM_EESIZE_R_WORDCNT_BIT      (0U)
#define EEPROM_EESIZE_R_WORDCNT_NUMBER   ((uint32_t)0x00000200U)

#define EEPROM_EESIZE_WORDCNT_MASK       ((uint32_t)0x0000FFFFU)
#define EEPROM_EESIZE_WORDCNT_NUMBER     ((uint32_t)0x00000200U)
/*----------*/

/*----------*/
#define EEPROM_EESIZE_R_BLKCNT_MASK     ((uint32_t)0x07FF0000U)
#define EEPROM_EESIZE_R_BLKCNT_BIT      (16U)
#define EEPROM_EESIZE_R_BLKCNT_NUMBER   ((uint32_t)0x00200000U)

#define EEPROM_EESIZE_BLKCNT_MASK       ((uint32_t)0x000007FFU)
#define EEPROM_EESIZE_BLKCNT_NUMBER     ((uint32_t)0x00000020U)
/*----------*/

/******************************************************************************************
************************************ 2 EEBLOCK *********************************************
******************************************************************************************/

/*----------*/
#define EEPROM_EEBLOCK_R_BLOCK_MASK     ((uint32_t)0x0000FFFFU)
#define EEPROM_EEBLOCK_R_BLOCK_BIT      (0U)

#define EEPROM_EEBLOCK_BLOCK_MASK       ((uint32_t)0x0000FFFFU)
/*----------*/

/******************************************************************************************
************************************ 3 EEOFFSET *********************************************
******************************************************************************************/

/*----------*/
#define EEPROM_EEOFFSET_R_OFFSET_MASK     ((uint32_t)0x0000000FU)
#define EEPROM_EEOFFSET_R_OFFSET_BIT      (0U)

#define EEPROM_EEOFFSET_OFFSET_MASK       ((uint32_t)0x0000000FU)
/*----------*/

/******************************************************************************************
************************************ 4 EERDWR *********************************************
******************************************************************************************/

/*----------*/
#define EEPROM_EERDWR_R_VALUE_MASK     ((uint32_t)0xFFFFFFFFU)
#define EEPROM_EERDWR_R_VALUE_BIT      (0U)

#define EEPROM_EERDWR_VALUE_MASK       ((uint32_t)0xFFFFFFFFU)
/*----------*/

/******************************************************************************************
************************************ 5 EERDWRINC *********************************************
******************************************************************************************/

/*----------*/
#define EEPROM_EERDWRINC_R_VALUE_MASK     ((uint32_t)0xFFFFFFFFU)
#define EEPROM_EERDWRINC_R_VALUE_BIT      (0U)

#define EEPROM_EERDWRINC_VALUE_MASK       ((uint32_t)0xFFFFFFFFU)
/*----------*/

/******************************************************************************************
************************************ 6 EEDONE *********************************************
******************************************************************************************/

/*----------*/
#define EEPROM_EEDONE_R_WORKING_MASK     ((uint32_t)0x00000001U)
#define EEPROM_EEDONE_R_WORKING_BIT      (0U)
#define EEPROM_EEDONE_R_WORKING_DIS      ((uint32_t)0x00000000U)
#define EEPROM_EEDONE_R_WORKING_EN       ((uint32_t)0x00000001U)

#define EEPROM_EEDONE_WORKING_MASK       ((uint32_t)0x00000001U)
#define EEPROM_EEDONE_WORKING_DIS        ((uint32_t)0x00000000U)
#define EEPROM_EEDONE_WORKING_EN         ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define EEPROM_EEDONE_R_WKERASE_MASK     ((uint32_t)0x00000004U)
#define EEPROM_EEDONE_R_WKERASE_BIT      (2U)
#define EEPROM_EEDONE_R_WKERASE_DIS      ((uint32_t)0x00000000U)
#define EEPROM_EEDONE_R_WKERASE_EN       ((uint32_t)0x00000004U)

#define EEPROM_EEDONE_WKERASE_MASK       ((uint32_t)0x00000001U)
#define EEPROM_EEDONE_WKERASE_DIS        ((uint32_t)0x00000000U)
#define EEPROM_EEDONE_WKERASE_EN         ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define EEPROM_EEDONE_R_WKCOPY_MASK     ((uint32_t)0x00000008U)
#define EEPROM_EEDONE_R_WKCOPY_BIT      (3U)
#define EEPROM_EEDONE_R_WKCOPY_DIS      ((uint32_t)0x00000000U)
#define EEPROM_EEDONE_R_WKCOPY_EN       ((uint32_t)0x00000008U)

#define EEPROM_EEDONE_WKCOPY_MASK       ((uint32_t)0x00000001U)
#define EEPROM_EEDONE_WKCOPY_DIS        ((uint32_t)0x00000000U)
#define EEPROM_EEDONE_WKCOPY_EN         ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define EEPROM_EEDONE_R_NOPERM_MASK     ((uint32_t)0x00000010U)
#define EEPROM_EEDONE_R_NOPERM_BIT      (4U)
#define EEPROM_EEDONE_R_NOPERM_NOERROR  ((uint32_t)0x00000000U)
#define EEPROM_EEDONE_R_NOPERM_ERROR    ((uint32_t)0x00000010U)

#define EEPROM_EEDONE_NOPERM_MASK       ((uint32_t)0x00000001U)
#define EEPROM_EEDONE_NOPERM_NOERROR    ((uint32_t)0x00000000U)
#define EEPROM_EEDONE_NOPERM_ERROR      ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define EEPROM_EEDONE_R_WRBUSY_MASK     ((uint32_t)0x00000020U)
#define EEPROM_EEDONE_R_WRBUSY_BIT      (5U)
#define EEPROM_EEDONE_R_WRBUSY_NOERROR  ((uint32_t)0x00000000U)
#define EEPROM_EEDONE_R_WRBUSY_ERROR    ((uint32_t)0x00000020U)

