InDeviceMex/TM4C123/TM4C123_ACOMP/xDriver_MCU/EEPROM/Peripheral/Register/xHeader/EEPROM_RegisterDefines.h
#define EEPROM_EEDONE_WRBUSY_MASK       ((uint32_t)0x00000001U)
#define EEPROM_EEDONE_WRBUSY_NOERROR    ((uint32_t)0x00000000U)
#define EEPROM_EEDONE_WRBUSY_ERROR      ((uint32_t)0x00000001U)
/*----------*/

/******************************************************************************************
************************************7 EESUPP *********************************************
******************************************************************************************/

/*----------*/
#define EEPROM_EESUPP_R_START_MASK     ((uint32_t)0x00000001U)
#define EEPROM_EESUPP_R_START_BIT      (0U)
#define EEPROM_EESUPP_R_START_DIS      ((uint32_t)0x00000000U)
#define EEPROM_EESUPP_R_START_EN       ((uint32_t)0x00000001U)

#define EEPROM_EESUPP_START_MASK       ((uint32_t)0x00000001U)
#define EEPROM_EESUPP_START_DIS        ((uint32_t)0x00000000U)
#define EEPROM_EESUPP_START_EN         ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define EEPROM_EESUPP_R_EREQ_MASK     ((uint32_t)0x00000002U)
#define EEPROM_EESUPP_R_EREQ_BIT      (1U)
#define EEPROM_EESUPP_R_EREQ_DIS      ((uint32_t)0x00000000U)
#define EEPROM_EESUPP_R_EREQ_EN       ((uint32_t)0x00000002U)

#define EEPROM_EESUPP_EREQ_MASK       ((uint32_t)0x00000001U)
#define EEPROM_EESUPP_EREQ_DIS        ((uint32_t)0x00000000U)
#define EEPROM_EESUPP_EREQ_EN         ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define EEPROM_EESUPP_R_ERETRY_MASK     ((uint32_t)0x00000004U)
#define EEPROM_EESUPP_R_ERETRY_BIT      (2U)
#define EEPROM_EESUPP_R_ERETRY_DIS      ((uint32_t)0x00000000U)
#define EEPROM_EESUPP_R_ERETRY_EN       ((uint32_t)0x00000004U)

#define EEPROM_EESUPP_ERETRY_MASK       ((uint32_t)0x00000001U)
#define EEPROM_EESUPP_ERETRY_DIS        ((uint32_t)0x00000000U)
#define EEPROM_EESUPP_ERETRY_EN         ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define EEPROM_EESUPP_R_PRETRY_MASK     ((uint32_t)0x00000008U)
#define EEPROM_EESUPP_R_PRETRY_BIT      (3U)
#define EEPROM_EESUPP_R_PRETRY_NOERROR  ((uint32_t)0x00000000U)
#define EEPROM_EESUPP_R_PRETRY_ERROR    ((uint32_t)0x00000008U)

#define EEPROM_EESUPP_PRETRY_MASK       ((uint32_t)0x00000001U)
#define EEPROM_EESUPP_PRETRY_NOERROR    ((uint32_t)0x00000000U)
#define EEPROM_EESUPP_PRETRY_ERROR      ((uint32_t)0x00000001U)
/*----------*/

/******************************************************************************************
************************************8 EEUNLOCK *********************************************
******************************************************************************************/

/*----------*/
#define EEPROM_EEUNLOCK_R_UNLOCK_MASK     ((uint32_t)0xFFFFFFFFU)
#define EEPROM_EEUNLOCK_R_UNLOCK_BIT      (0U)

#define EEPROM_EEUNLOCK_UNLOCK_MASK       ((uint32_t)0xFFFFFFFFU)
/*----------*/

/******************************************************************************************
************************************ 9 EEPROT *********************************************
******************************************************************************************/

/*----------*/
#define EEPROM_EEPROT_R_PROT_MASK           ((uint32_t)0x00000007U)
#define EEPROM_EEPROT_R_PROT_BIT            (0U)
#define EEPROM_EEPROT_R_PROT_NOPASS_RDWR    ((uint32_t)0x00000000U)
#define EEPROM_EEPROT_R_PROT_PASS_RDWR      ((uint32_t)0x00000001U)
#define EEPROM_EEPROT_R_PROT_NOPASS_RD      ((uint32_t)0x00000002U)

#define EEPROM_EEPROT_PROT_MASK           ((uint32_t)0x00000007U)
#define EEPROM_EEPROT_PROT_NOPASS_RDWR    ((uint32_t)0x00000000U)
#define EEPROM_EEPROT_PROT_PASS_RDWR      ((uint32_t)0x00000001U)
#define EEPROM_EEPROT_PROT_NOPASS_RD      ((uint32_t)0x00000002U)
/*----------*/

/*----------*/
#define EEPROM_EEPROT_R_ACC_MASK           ((uint32_t)0x00000008U)
#define EEPROM_EEPROT_R_ACC_BIT            (3U)
#define EEPROM_EEPROT_R_ACC_BOTH           ((uint32_t)0x00000000U)
#define EEPROM_EEPROT_R_ACC_SUPERVISOR     ((uint32_t)0x00000008U)

#define EEPROM_EEPROT_ACC_MASK           ((uint32_t)0x00000001U)
#define EEPROM_EEPROT_ACC_BOTH           ((uint32_t)0x00000000U)
#define EEPROM_EEPROT_ACC_SUPERVISOR     ((uint32_t)0x00000001U)
/*----------*/

/******************************************************************************************
************************************ 10 EEPASS0 *********************************************
******************************************************************************************/

/*----------*/
#define EEPROM_EEPASS0_R_PASS_MASK     ((uint32_t)0xFFFFFFFFU)
#define EEPROM_EEPASS0_R_PASS_BIT      (0U)
#define EEPROM_EEPASS0_R_PASS_NOSET    ((uint32_t)0x00000000U)
#define EEPROM_EEPASS0_R_PASS_SET      ((uint32_t)0x00000001U)

#define EEPROM_EEPASS0_PASS_MASK       ((uint32_t)0xFFFFFFFFU)
#define EEPROM_EEPASS0_PASS_NOSET      ((uint32_t)0x00000000U)
#define EEPROM_EEPASS0_PASS_SET        ((uint32_t)0x00000001U)
/*----------*/

/******************************************************************************************
************************************11 EEPASS1 *********************************************
******************************************************************************************/

/*----------*/
#define EEPROM_EEPASS1_R_PASS_MASK     ((uint32_t)0xFFFFFFFFU)
#define EEPROM_EEPASS1_R_PASS_BIT      (0U)
#define EEPROM_EEPASS1_R_PASS_NOSET    ((uint32_t)0x00000000U)
#define EEPROM_EEPASS1_R_PASS_SET      ((uint32_t)0x00000001U)

#define EEPROM_EEPASS1_PASS_MASK       ((uint32_t)0xFFFFFFFFU)
#define EEPROM_EEPASS1_PASS_NOSET      ((uint32_t)0x00000000U)
#define EEPROM_EEPASS1_PASS_SET        ((uint32_t)0x00000001U)
/*----------*/

/******************************************************************************************
************************************12 EEPASS2 *********************************************
******************************************************************************************/

/*----------*/
#define EEPROM_EEPASS2_R_PASS_MASK     ((uint32_t)0xFFFFFFFFU)
#define EEPROM_EEPASS2_R_PASS_BIT      (0U)
#define EEPROM_EEPASS2_R_PASS_NOSET    ((uint32_t)0x00000000U)
#define EEPROM_EEPASS2_R_PASS_SET      ((uint32_t)0x00000001U)

#define EEPROM_EEPASS2_PASS_MASK       ((uint32_t)0xFFFFFFFFU)
#define EEPROM_EEPASS2_PASS_NOSET      ((uint32_t)0x00000000U)
#define EEPROM_EEPASS2_PASS_SET        ((uint32_t)0x00000001U)
/*----------*/

/******************************************************************************************
************************************13 EEINT *********************************************
******************************************************************************************/

/*----------*/
#define EEPROM_EEINT_R_INT_MASK       ((uint32_t)0x00000001U)
#define EEPROM_EEINT_R_INT_BIT        (0U)
#define EEPROM_EEINT_R_INT_NOOCCUR    ((uint32_t)0x00000000U)
#define EEPROM_EEINT_R_INT_OCCUR      ((uint32_t)0x00000001U)

