InDeviceMex/TM4C123/TM4C123_ACOMP/xDriver_MCU/EEPROM/Peripheral/Register/xHeader/EEPROM_RegisterDefines.h
#define EEPROM_EEINT_INT_MASK         ((uint32_t)0x00000001U)
#define EEPROM_EEINT_INT_NOOCCUR      ((uint32_t)0x00000000U)
#define EEPROM_EEINT_INT_OCCUR        ((uint32_t)0x00000001U)
/*----------*/

/******************************************************************************************
************************************14 EEHIDE *********************************************
******************************************************************************************/

/*----------*/
#define EEPROM_EEHIDE_R_H1_MASK       ((uint32_t)0x00000002U)
#define EEPROM_EEHIDE_R_H1_BIT        (1U)
#define EEPROM_EEHIDE_R_H1_NOHIDE     ((uint32_t)0x00000000U)
#define EEPROM_EEHIDE_R_H1_HIDE       ((uint32_t)0x00000002U)

#define EEPROM_EEHIDE_H1_MASK         ((uint32_t)0x00000001U)
#define EEPROM_EEHIDE_H1_NOHIDE       ((uint32_t)0x00000000U)
#define EEPROM_EEHIDE_H1_HIDE         ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define EEPROM_EEHIDE_R_H2_MASK       ((uint32_t)0x00000004U)
#define EEPROM_EEHIDE_R_H2_BIT        (2U)
#define EEPROM_EEHIDE_R_H2_NOHIDE     ((uint32_t)0x00000000U)
#define EEPROM_EEHIDE_R_H2_HIDE       ((uint32_t)0x00000004U)

#define EEPROM_EEHIDE_H2_MASK         ((uint32_t)0x00000001U)
#define EEPROM_EEHIDE_H2_NOHIDE       ((uint32_t)0x00000000U)
#define EEPROM_EEHIDE_H2_HIDE         ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define EEPROM_EEHIDE_R_H3_MASK       ((uint32_t)0x00000008U)
#define EEPROM_EEHIDE_R_H3_BIT        (3U)
#define EEPROM_EEHIDE_R_H3_NOHIDE     ((uint32_t)0x00000000U)
#define EEPROM_EEHIDE_R_H3_HIDE       ((uint32_t)0x00000008U)

#define EEPROM_EEHIDE_H3_MASK         ((uint32_t)0x00000001U)
#define EEPROM_EEHIDE_H3_NOHIDE       ((uint32_t)0x00000000U)
#define EEPROM_EEHIDE_H3_HIDE         ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define EEPROM_EEHIDE_R_H4_MASK       ((uint32_t)0x00000010U)
#define EEPROM_EEHIDE_R_H4_BIT        (4U)
#define EEPROM_EEHIDE_R_H4_NOHIDE     ((uint32_t)0x00000000U)
#define EEPROM_EEHIDE_R_H4_HIDE       ((uint32_t)0x000000010U)

#define EEPROM_EEHIDE_H4_MASK         ((uint32_t)0x00000001U)
#define EEPROM_EEHIDE_H4_NOHIDE       ((uint32_t)0x00000000U)
#define EEPROM_EEHIDE_H4_HIDE         ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define EEPROM_EEHIDE_R_H5_MASK       ((uint32_t)0x00000020U)
#define EEPROM_EEHIDE_R_H5_BIT        (5U)
#define EEPROM_EEHIDE_R_H5_NOHIDE     ((uint32_t)0x00000000U)
#define EEPROM_EEHIDE_R_H5_HIDE       ((uint32_t)0x00000020U)

#define EEPROM_EEHIDE_H5_MASK         ((uint32_t)0x00000001U)
#define EEPROM_EEHIDE_H5_NOHIDE       ((uint32_t)0x00000000U)
#define EEPROM_EEHIDE_H5_HIDE         ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define EEPROM_EEHIDE_R_H6_MASK       ((uint32_t)0x00000040U)
#define EEPROM_EEHIDE_R_H6_BIT        (6U)
#define EEPROM_EEHIDE_R_H6_NOHIDE     ((uint32_t)0x00000000U)
#define EEPROM_EEHIDE_R_H6_HIDE       ((uint32_t)0x00000040U)

#define EEPROM_EEHIDE_H6_MASK         ((uint32_t)0x00000001U)
#define EEPROM_EEHIDE_H6_NOHIDE       ((uint32_t)0x00000000U)
#define EEPROM_EEHIDE_H6_HIDE         ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define EEPROM_EEHIDE_R_H7_MASK       ((uint32_t)0x00000080U)
#define EEPROM_EEHIDE_R_H7_BIT        (7U)
#define EEPROM_EEHIDE_R_H7_NOHIDE     ((uint32_t)0x00000000U)
#define EEPROM_EEHIDE_R_H7_HIDE       ((uint32_t)0x00000080U)

#define EEPROM_EEHIDE_H7_MASK         ((uint32_t)0x00000001U)
#define EEPROM_EEHIDE_H7_NOHIDE       ((uint32_t)0x00000000U)
#define EEPROM_EEHIDE_H7_HIDE         ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define EEPROM_EEHIDE_R_H8_MASK       ((uint32_t)0x00000100U)
#define EEPROM_EEHIDE_R_H8_BIT        (8U)
#define EEPROM_EEHIDE_R_H8_NOHIDE     ((uint32_t)0x00000000U)
#define EEPROM_EEHIDE_R_H8_HIDE       ((uint32_t)0x00000100U)

#define EEPROM_EEHIDE_H8_MASK         ((uint32_t)0x00000001U)
#define EEPROM_EEHIDE_H8_NOHIDE       ((uint32_t)0x00000000U)
#define EEPROM_EEHIDE_H8_HIDE         ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define EEPROM_EEHIDE_R_H9_MASK       ((uint32_t)0x00000200U)
#define EEPROM_EEHIDE_R_H9_BIT        (9U)
#define EEPROM_EEHIDE_R_H9_NOHIDE     ((uint32_t)0x00000000U)
#define EEPROM_EEHIDE_R_H9_HIDE       ((uint32_t)0x00000200U)

#define EEPROM_EEHIDE_H9_MASK         ((uint32_t)0x00000001U)
#define EEPROM_EEHIDE_H9_NOHIDE       ((uint32_t)0x00000000U)
#define EEPROM_EEHIDE_H9_HIDE         ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define EEPROM_EEHIDE_R_H10_MASK       ((uint32_t)0x00000400U)
#define EEPROM_EEHIDE_R_H10_BIT        (10U)
#define EEPROM_EEHIDE_R_H10_NOHIDE     ((uint32_t)0x00000000U)
#define EEPROM_EEHIDE_R_H10_HIDE       ((uint32_t)0x00000400U)

#define EEPROM_EEHIDE_H10_MASK         ((uint32_t)0x00000001U)
#define EEPROM_EEHIDE_H10_NOHIDE       ((uint32_t)0x00000000U)
#define EEPROM_EEHIDE_H10_HIDE         ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define EEPROM_EEHIDE_R_H11_MASK       ((uint32_t)0x00000800U)
#define EEPROM_EEHIDE_R_H11_BIT        (11U)
#define EEPROM_EEHIDE_R_H11_NOHIDE     ((uint32_t)0x00000000U)
#define EEPROM_EEHIDE_R_H11_HIDE       ((uint32_t)0x00000800U)

#define EEPROM_EEHIDE_H11_MASK         ((uint32_t)0x00000001U)
#define EEPROM_EEHIDE_H11_NOHIDE       ((uint32_t)0x00000000U)
#define EEPROM_EEHIDE_H11_HIDE         ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define EEPROM_EEHIDE_R_H12_MASK       ((uint32_t)0x00001000U)
#define EEPROM_EEHIDE_R_H12_BIT        (12U)
#define EEPROM_EEHIDE_R_H12_NOHIDE     ((uint32_t)0x00000000U)
#define EEPROM_EEHIDE_R_H12_HIDE       ((uint32_t)0x00001000U)

#define EEPROM_EEHIDE_H12_MASK         ((uint32_t)0x00000001U)
#define EEPROM_EEHIDE_H12_NOHIDE       ((uint32_t)0x00000000U)
#define EEPROM_EEHIDE_H12_HIDE         ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define EEPROM_EEHIDE_R_H13_MASK       ((uint32_t)0x00002000U)
#define EEPROM_EEHIDE_R_H13_BIT        (13U)
#define EEPROM_EEHIDE_R_H13_NOHIDE     ((uint32_t)0x00000000U)
#define EEPROM_EEHIDE_R_H13_HIDE       ((uint32_t)0x00002000U)

#define EEPROM_EEHIDE_H13_MASK         ((uint32_t)0x00000001U)
#define EEPROM_EEHIDE_H13_NOHIDE       ((uint32_t)0x00000000U)
#define EEPROM_EEHIDE_H13_HIDE         ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define EEPROM_EEHIDE_R_H14_MASK       ((uint32_t)0x00004000U)
#define EEPROM_EEHIDE_R_H14_BIT        (14U)
#define EEPROM_EEHIDE_R_H14_NOHIDE     ((uint32_t)0x00000000U)
#define EEPROM_EEHIDE_R_H14_HIDE       ((uint32_t)0x00004000U)

#define EEPROM_EEHIDE_H14_MASK         ((uint32_t)0x00000001U)
#define EEPROM_EEHIDE_H14_NOHIDE       ((uint32_t)0x00000000U)
#define EEPROM_EEHIDE_H14_HIDE         ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define EEPROM_EEHIDE_R_H15_MASK       ((uint32_t)0x00008000U)
#define EEPROM_EEHIDE_R_H15_BIT        (15U)
#define EEPROM_EEHIDE_R_H15_NOHIDE     ((uint32_t)0x00000000U)
#define EEPROM_EEHIDE_R_H15_HIDE       ((uint32_t)0x00008000U)

#define EEPROM_EEHIDE_H15_MASK         ((uint32_t)0x00000001U)
#define EEPROM_EEHIDE_H15_NOHIDE       ((uint32_t)0x00000000U)
#define EEPROM_EEHIDE_H15_HIDE         ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define EEPROM_EEHIDE_R_H16_MASK       ((uint32_t)0x00010000U)
#define EEPROM_EEHIDE_R_H16_BIT        (16U)
#define EEPROM_EEHIDE_R_H16_NOHIDE     ((uint32_t)0x00000000U)
#define EEPROM_EEHIDE_R_H16_HIDE       ((uint32_t)0x00010000U)

