InDeviceMex/TM4C123/TM4C123_ACOMP/xDriver_MCU/EEPROM/Peripheral/Register/xHeader/EEPROM_RegisterDefines.h
#define EEPROM_EEHIDE_H16_MASK         ((uint32_t)0x00000001U)
#define EEPROM_EEHIDE_H16_NOHIDE       ((uint32_t)0x00000000U)
#define EEPROM_EEHIDE_H16_HIDE         ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define EEPROM_EEHIDE_R_H17_MASK       ((uint32_t)0x00020000U)
#define EEPROM_EEHIDE_R_H17_BIT        (17U)
#define EEPROM_EEHIDE_R_H17_NOHIDE     ((uint32_t)0x00000000U)
#define EEPROM_EEHIDE_R_H17_HIDE       ((uint32_t)0x00020000U)

#define EEPROM_EEHIDE_H17_MASK         ((uint32_t)0x00000001U)
#define EEPROM_EEHIDE_H17_NOHIDE       ((uint32_t)0x00000000U)
#define EEPROM_EEHIDE_H17_HIDE         ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define EEPROM_EEHIDE_R_H18_MASK       ((uint32_t)0x00040000U)
#define EEPROM_EEHIDE_R_H18_BIT        (18U)
#define EEPROM_EEHIDE_R_H18_NOHIDE     ((uint32_t)0x00000000U)
#define EEPROM_EEHIDE_R_H18_HIDE       ((uint32_t)0x00040000U)

#define EEPROM_EEHIDE_H18_MASK         ((uint32_t)0x00000001U)
#define EEPROM_EEHIDE_H18_NOHIDE       ((uint32_t)0x00000000U)
#define EEPROM_EEHIDE_H18_HIDE         ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define EEPROM_EEHIDE_R_H19_MASK       ((uint32_t)0x00080000U)
#define EEPROM_EEHIDE_R_H19_BIT        (19U)
#define EEPROM_EEHIDE_R_H19_NOHIDE     ((uint32_t)0x00000000U)
#define EEPROM_EEHIDE_R_H19_HIDE       ((uint32_t)0x00080000U)

#define EEPROM_EEHIDE_H19_MASK         ((uint32_t)0x00000001U)
#define EEPROM_EEHIDE_H19_NOHIDE       ((uint32_t)0x00000000U)
#define EEPROM_EEHIDE_H19_HIDE         ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define EEPROM_EEHIDE_R_H20_MASK       ((uint32_t)0x00100000U)
#define EEPROM_EEHIDE_R_H20_BIT        (20U)
#define EEPROM_EEHIDE_R_H20_NOHIDE     ((uint32_t)0x00000000U)
#define EEPROM_EEHIDE_R_H20_HIDE       ((uint32_t)0x00100000U)

#define EEPROM_EEHIDE_H20_MASK         ((uint32_t)0x00000001U)
#define EEPROM_EEHIDE_H20_NOHIDE       ((uint32_t)0x00000000U)
#define EEPROM_EEHIDE_H20_HIDE         ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define EEPROM_EEHIDE_R_H21_MASK       ((uint32_t)0x00200000U)
#define EEPROM_EEHIDE_R_H21_BIT        (21U)
#define EEPROM_EEHIDE_R_H21_NOHIDE     ((uint32_t)0x00000000U)
#define EEPROM_EEHIDE_R_H21_HIDE       ((uint32_t)0x00200000U)

#define EEPROM_EEHIDE_H21_MASK         ((uint32_t)0x00000001U)
#define EEPROM_EEHIDE_H21_NOHIDE       ((uint32_t)0x00000000U)
#define EEPROM_EEHIDE_H21_HIDE         ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define EEPROM_EEHIDE_R_H22_MASK       ((uint32_t)0x00400000U)
#define EEPROM_EEHIDE_R_H22_BIT        (22U)
#define EEPROM_EEHIDE_R_H22_NOHIDE     ((uint32_t)0x00000000U)
#define EEPROM_EEHIDE_R_H22_HIDE       ((uint32_t)0x00400000U)

#define EEPROM_EEHIDE_H22_MASK         ((uint32_t)0x00000001U)
#define EEPROM_EEHIDE_H22_NOHIDE       ((uint32_t)0x00000000U)
#define EEPROM_EEHIDE_H22_HIDE         ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define EEPROM_EEHIDE_R_H23_MASK       ((uint32_t)0x00800000U)
#define EEPROM_EEHIDE_R_H23_BIT        (23U)
#define EEPROM_EEHIDE_R_H23_NOHIDE     ((uint32_t)0x00000000U)
#define EEPROM_EEHIDE_R_H23_HIDE       ((uint32_t)0x00800000U)

#define EEPROM_EEHIDE_H23_MASK         ((uint32_t)0x00000001U)
#define EEPROM_EEHIDE_H23_NOHIDE       ((uint32_t)0x00000000U)
#define EEPROM_EEHIDE_H23_HIDE         ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define EEPROM_EEHIDE_R_H24_MASK       ((uint32_t)0x01000000U)
#define EEPROM_EEHIDE_R_H24_BIT        (24U)
#define EEPROM_EEHIDE_R_H24_NOHIDE     ((uint32_t)0x00000000U)
#define EEPROM_EEHIDE_R_H24_HIDE       ((uint32_t)0x01000000U)

#define EEPROM_EEHIDE_H24_MASK         ((uint32_t)0x00000001U)
#define EEPROM_EEHIDE_H24_NOHIDE       ((uint32_t)0x00000000U)
#define EEPROM_EEHIDE_H24_HIDE         ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define EEPROM_EEHIDE_R_H25_MASK       ((uint32_t)0x02000000U)
#define EEPROM_EEHIDE_R_H25_BIT        (25U)
#define EEPROM_EEHIDE_R_H25_NOHIDE     ((uint32_t)0x00000000U)
#define EEPROM_EEHIDE_R_H25_HIDE       ((uint32_t)0x02000000U)

#define EEPROM_EEHIDE_H25_MASK         ((uint32_t)0x00000001U)
#define EEPROM_EEHIDE_H25_NOHIDE       ((uint32_t)0x00000000U)
#define EEPROM_EEHIDE_H25_HIDE         ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define EEPROM_EEHIDE_R_H26_MASK       ((uint32_t)0x04000000U)
#define EEPROM_EEHIDE_R_H26_BIT        (26U)
#define EEPROM_EEHIDE_R_H26_NOHIDE     ((uint32_t)0x00000000U)
#define EEPROM_EEHIDE_R_H26_HIDE       ((uint32_t)0x04000000U)

#define EEPROM_EEHIDE_H26_MASK         ((uint32_t)0x00000001U)
#define EEPROM_EEHIDE_H26_NOHIDE       ((uint32_t)0x00000000U)
#define EEPROM_EEHIDE_H26_HIDE         ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define EEPROM_EEHIDE_R_H27_MASK       ((uint32_t)0x08000000U)
#define EEPROM_EEHIDE_R_H27_BIT        (27U)
#define EEPROM_EEHIDE_R_H27_NOHIDE     ((uint32_t)0x00000000U)
#define EEPROM_EEHIDE_R_H27_HIDE       ((uint32_t)0x08000000U)

#define EEPROM_EEHIDE_H27_MASK         ((uint32_t)0x00000001U)
#define EEPROM_EEHIDE_H27_NOHIDE       ((uint32_t)0x00000000U)
#define EEPROM_EEHIDE_H27_HIDE         ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define EEPROM_EEHIDE_R_H28_MASK       ((uint32_t)0x10000000U)
#define EEPROM_EEHIDE_R_H28_BIT        (28U)
#define EEPROM_EEHIDE_R_H28_NOHIDE     ((uint32_t)0x00000000U)
#define EEPROM_EEHIDE_R_H28_HIDE       ((uint32_t)0x10000000U)

#define EEPROM_EEHIDE_H28_MASK         ((uint32_t)0x00000001U)
#define EEPROM_EEHIDE_H28_NOHIDE       ((uint32_t)0x00000000U)
#define EEPROM_EEHIDE_H28_HIDE         ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define EEPROM_EEHIDE_R_H29_MASK       ((uint32_t)0x20000000U)
#define EEPROM_EEHIDE_R_H29_BIT        (29U)
#define EEPROM_EEHIDE_R_H29_NOHIDE     ((uint32_t)0x00000000U)
#define EEPROM_EEHIDE_R_H29_HIDE       ((uint32_t)0x20000000U)

#define EEPROM_EEHIDE_H29_MASK         ((uint32_t)0x00000001U)
#define EEPROM_EEHIDE_H29_NOHIDE       ((uint32_t)0x00000000U)
#define EEPROM_EEHIDE_H29_HIDE         ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define EEPROM_EEHIDE_R_H30_MASK       ((uint32_t)0x40000000U)
#define EEPROM_EEHIDE_R_H30_BIT        (30U)
#define EEPROM_EEHIDE_R_H30_NOHIDE     ((uint32_t)0x00000000U)
#define EEPROM_EEHIDE_R_H30_HIDE       ((uint32_t)0x40000000U)

