InDeviceMex/TM4C123/TM4C123_ACOMP/xDriver_MCU/EEPROM/Peripheral/Register/xHeader/EEPROM_RegisterDefines.h
#define EEPROM_EEHIDE_H30_MASK         ((uint32_t)0x00000001U)
#define EEPROM_EEHIDE_H30_NOHIDE       ((uint32_t)0x00000000U)
#define EEPROM_EEHIDE_H30_HIDE         ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define EEPROM_EEHIDE_R_H31_MASK       ((uint32_t)0x80000000U)
#define EEPROM_EEHIDE_R_H31_BIT        (31U)
#define EEPROM_EEHIDE_R_H31_NOHIDE     ((uint32_t)0x00000000U)
#define EEPROM_EEHIDE_R_H31_HIDE       ((uint32_t)0x80000000U)

#define EEPROM_EEHIDE_H31_MASK         ((uint32_t)0x00000001U)
#define EEPROM_EEHIDE_H31_NOHIDE       ((uint32_t)0x00000000U)
#define EEPROM_EEHIDE_H31_HIDE         ((uint32_t)0x00000001U)
/*----------*/

/******************************************************************************************
************************************15 EEDBGME *********************************************
******************************************************************************************/

/*----------*/
#define EEPROM_EEDBGME_R_ME_MASK       ((uint32_t)0x00000001U)
#define EEPROM_EEDBGME_R_ME_BIT        (0U)
#define EEPROM_EEDBGME_R_ME_NA         ((uint32_t)0x00000000U)
#define EEPROM_EEDBGME_R_ME_ERASE      ((uint32_t)0x00000001U)

#define EEPROM_EEDBGME_ME_MASK         ((uint32_t)0x00000001U)
#define EEPROM_EEDBGME_ME_NA           ((uint32_t)0x00000000U)
#define EEPROM_EEDBGME_ME_ERASE        ((uint32_t)0x00000001U)
/*----------*/

/*----------*/
#define EEPROM_EEDBGME_R_KEY_MASK       ((uint32_t)0xFFFF0000U)
#define EEPROM_EEDBGME_R_KEY_BIT        (0U)
#define EEPROM_EEDBGME_R_KEY_ERASE      ((uint32_t)0xE37B0000U)

#define EEPROM_EEDBGME_KEY_MASK         ((uint32_t)0x0000FFFFU)
#define EEPROM_EEDBGME_KEY_ERASE        ((uint32_t)0x0000E37BU)
/*----------*/

/******************************************************************************************
************************************16 EEPROMPP *********************************************
******************************************************************************************/

/*----------*/
#define EEPROM_EEPROMPP_R_SIZE_MASK       ((uint32_t)0x0000001FU)
#define EEPROM_EEPROMPP_R_SIZE_BIT        (0U)
#define EEPROM_EEPROMPP_R_SIZE_2KB        ((uint32_t)0x0000001FU)

#define EEPROM_EEPROMPP_SIZE_MASK         ((uint32_t)0x0000001FU)
#define EEPROM_EEPROMPP_SIZE_2KB          ((uint32_t)0x0000001FU)
/*----------*/



#endif /* XDRIVER_MCU_DRIVER_HEADER_EEPROM_EEPROM_PERIPHERAL_EEPROM_REGISTER_EEPROM_REGISTERDEFINES_H_ */
